# 页相关(MySQL插入和查询原理) 
    
    MySQL默认对插入的数据根据id进行排序
    
## 参考文档： https://zhuanlan.zhihu.com/p/96803704
 
## 页的概念
    
    操作系统的一个页表项的大小是4KB
    
    MySQL的数据正是以页为基本单位组合而成的
    MySQL的InnoDb引擎中，页的大小是16KB，一页是可以存放很多很多条数据

### 操作系统查询    
    
    在操作系统的概念中,当我们往磁盘中取数据，假设要取出的数据的大小是1KB, 但会取出4KB的数据
    
    程序局部性：
        
        一个程序在访问了一条数据之后，在之后会有极大的可能再次访问这条数据和访问这条数据的相邻数据。
        
        所以索性直接加载4KB的数据到内存中，下次要访问这一页的数据时，直接从内存中找，可以减少磁盘IO次数

### MySQL的查询
    
    数据中有id为1到10的10条数据
    
    找到id = 5这条数据的过程：
    
        1. 遍历：
            首先，我们得先从id=1的数据开始读起，然后判断是否是我们需要的数据，如果不是，就再取id=2的数据，再进行判断，循环往复。
            毋庸置疑，在MySQL帮我们排好序之后，我们需要经历五次磁盘IO，才能将5号数据找到并读出来
        
        2.引入页查询
            
            MySQL会将多条数据存在一个叫“页”的数据结构中，当MySQL读取id=1的数据时，会将id=1数据所在的页整页读到内存中，
            然后在内存中进行遍历判断，由于内存的IO速度比磁盘高很多，所以相对于磁盘IO，几乎可以忽略不计，
            那么我们来看看这样读取数据我们需要经历几次磁盘IO（假设每一页可以存4条数据）
            
            第一次会读取id=1的数据，并且将id=1到id=4的数据全部读到内存中，这是第一次磁盘IO，第二次将读取id=5的数据到内存中，
            这是第二次磁盘IO。所以我们只需要经历2次磁盘IO就可以找到id=5的这条数据。

### 页模式的功能
    
    在查询某条数据的时候直接将一整页的数据加载到内存中，以减少硬盘IO次数，从而提高性能

## 排序对性能的影响
   
### 为什么数据库在插入数据时要对其进行排序呢？
    
    页内部存放数据的模块，实质上就是一个链表的结构，链表的特点也就是增删快，查询慢，所以优化查询的效率是必须的
    数据库在插入数据时要对其进行排序， 优化查询的效率。

### 查询一条不存在的数据
    
    找一个表中不存在的id，假设id=-1，那么现在的查询流程就是：
        
        将id=1的这一整页数据取出，进行逐个比对，那么当我们找到id=1的这条数据时，发现这个id大于我们所需要找的哪个id，
        由于数据库在插入数据时，已经进行过排序了，那么在id=1的数据后面，都是id>1的数据，所以我们就不需要再继续往下寻找了
        
    如果在插入时没有进行排序，那毋庸置疑，我们需要再继续往下进行寻找，逐条查找直到到结尾也没有找到这条数据，才能返回不存在这条数据。

### 页目录查询基于排序后实现

## 目录
    
    假设，我们这一页中有一百万条数据，我们要查的数据正好在最后一个，那么我们是不是一定要从前往后找到这一条数据呢？
    如果是这样，我们需要查找的次数就达到了一百万次，即使是在内存中查找，这个效率也是不高的
    
    目录页：管理的级别是页
    页目录：管理的级别是行。
    
## 页目录
    
    页目录就像是我们在看书的时候书本的目录一样，目录项1就相当于第一节，目录项2就相当于第二节，而每一条数据就相当于书本的每一页
    
    每个目录项会存放自己这个目录项当中最小的id：
    
        比如当前页有100条数据, 有5个目录, 每个目录里有20条数据, 目录1指向的是id为1的这条数据, 目录2指向的是id为21的这条数据

### 页目录查询        
    假设要查找id=22的数据：
        
        1. 没有页目录
            要查找id=1、id=2、id=3.....22次才能找到该数据
        
        2. 有页目录之后
            
            先查看一下id=22存在于哪个目录项下，然后直接通过目录项进行数据的查找即可，如果在该目录项下没有找到这条数据，
            那么就可以直接确定这条数据不存在
            
            页目录的实现，首先就需要基于数据是在已经进行过排序的的场景下，才可以发挥其作用
            
## 目录页
    
    目录页中的数据存放的就是指向的那一页中最小的数据

### 多页模式
    
    MySQL中每一页的大小只有16KB，不会随着数据的插入而自动扩容，所以这16KB不可能存下我们所有的数据
    在数据不断变多的情况下，MySQL会再去开辟新的页来存放新的数据，而每个页都有指向下一页的指针和指向上一页的指针，将所有页组织起来
    
    如第一页存放id为1-100的数据, 第二页存放id为101-200的数据, 第三页存放id为201-300的数据
    
    在开辟新页的时候，我们插入的数据不一定是放在新开辟的页上，而是要进行所有页的数据比较，来决定这条插入的数据放在哪一页上
    
### 多页模式对于查询效率的影响
    
    多页其本质也是一个链表结构，只要是链表结构，查询效率一定不会高
    
    数据非常多，数据库就会开辟非常多的新页，而这些新页就会像链表一样连接在一起，当我们要在这么多页中查询某条数据时，
    它还是会从头节点遍历到存在我们要查找的那条数据所存在的页上
    
    所以对于多页结构也可以采用页目录的方式，使用一个目录项来指向某一页，而这个目录项存放的就是这一页中存放的最小数据的索引值。
    和页目录不同的地方在于，这种目录管理的级别是页，而页目录管理的级别是行。
    
### 目录页的本质
    
    目录页的本质也是页，普通页中存的数据是项目数据，而目录页中存的数据是普通页的地址
    
### 目录页查询
    
    查找id=305的数据
    
    1. 无目录页
        
        从第一页中查询, 根据页目录判断数据在哪个目录下，如果查询不到, 就去下一页查询, 一致查到第四页才能查到这条数据
        
    2. 有目录页
        用id=305与目录页中存放的数据进行比较, 发现大于目录页中的301小于目录页中401, 就进入id=301指向的页进行查找，
        然后再通过页内的页目录行级别的数据的查找，很快就可以找到id为305的数据了
